Autodesk.Revit.DB.DimensionSegment.ResetTextPosition
Resets the text position of the segment to the initial position determined by its type and parameters.
Remarks: The initial point is the text location when dimension is created.
Since: 2015 Subscription Update

Autodesk.Revit.DB.DimensionSegment.TextPosition
The position of the dimension text's drag point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL
and will not allow setting a value.
Throws Autodesk.Revit.Exceptions.ApplicationException:
Thrown when the dimension text is unavailable.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when:
The dimension text is a SpotElevationWhen using equality formula.When dimension style is ordinate..
Since: 2015 Subscription Update

Autodesk.Revit.DB.DimensionSegment.IsTextPositionAdjustable
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
Returns: True if this dimension is supported to set/get TextPosition/LeaderPosition, false otherwise.
Since: 2015 Subscription Update

Autodesk.Revit.DB.DimensionSegment.LeaderEndPosition
The position of the dimension leader end point.
Remarks:
This property is not applicable to all dimensions.
For example, it is not available for spot dimensions,
dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL
and will not allow setting a value.
>
Since:
2015 Subscription Update.
Throws Autodesk.Revit.Exceptions.ApplicationException:
Thrown when the dimension text is unavailable.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when:
The dimension text is a SpotElevationWhen using equality formula.When dimension style is ordinate.

Autodesk.Revit.DB.DimensionSegment.ValueOverride
The text that replaces the segment's value.

Autodesk.Revit.DB.DimensionSegment.Below
The text shown below the segment's value.

Autodesk.Revit.DB.DimensionSegment.Above
The text shown above the segment's value.

Autodesk.Revit.DB.DimensionSegment.Suffix
The text shown after the segment's value.

Autodesk.Revit.DB.DimensionSegment.Prefix
The text shown before the segment's value.

Autodesk.Revit.DB.DimensionSegment.IsLocked
Indicates if this segment is locked.
Remarks:  This property always returns false if the dimension
is a radial or spot dimension.
This property cannot be set if the segment has been labeled, or
the dimension shape is a radial or spot dimension.

Autodesk.Revit.DB.DimensionSegment.ValueString
The displayed value shown for the dimension segment.

Autodesk.Revit.DB.DimensionSegment.Value
The length of the segment.

Autodesk.Revit.DB.DimensionSegment.Origin
The segment origin.
Remarks: The origin will be the midpoint of the line that
makes up the segment.

Autodesk.Revit.DB.DimensionSegment
A segment of a dimension within the Autodesk Revit project.